import 'package:flutter/material.dart';
import 'package:flutter/src/widgets/container.dart';
import 'package:flutter/src/widgets/framework.dart';

class termsConditions extends StatelessWidget {
  const termsConditions({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: ListView(
        children: [
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'Terms & Conditions الشروط والأحكام',
              style: TextStyle(
                fontWeight: FontWeight.bold,
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Center(
              child: Text(
                'Terms & Conditions الشروط والأحكام',
                style: TextStyle(
                  fontWeight: FontWeight.bold,
                  fontStyle: FontStyle.italic,
                  color: Colors.black,
                  fontSize: 24,
                ),
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'مقدمه اهلا بكم مع زيدا ،فيما يلي البنود والشروطالتي تخص استخدامك ودخولك لصفحات موقع زيدا و علي كافه الصفحات والروابط والادوات و الخواص المتفرغه منها.إن إستخدامك لموقع زيدا(أوردر فاست) هو موافقة منك على القبول ببنود وشروط هذه الإتفاقية والذي يتضمن كافة التفاصيل أدناه وهو تأكيد لإلتزامك بالاستجابة لمضمون هذه الإتفاقية الخاصة بشركة زيدا(أوردر فاست) والمشار إليه فيما يلي بإسم "نحن" ’ فيما يتعلق باستخدامك للموقع، والمشار إليه فيما يلي بـ " الإستخدام " وتعتبر هذه الإتفاقية سارية المفعول حال قبولك بخيار الموافقة. أنت موافق على أن يتم التواصل معك عبر البريد الإلكتروني، أو من خلال بث إعلانات ترويجة على الموقع، وأنت موافق على أن جميع الاتفاقيات والإعلانات والبيانات والاتصالات الأخرى التي تزود بها الكترونياً تقوم مقام مثيلاتها المكتوبة، في تلبية الاحتياجات القانونية',
              style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'و ستقوم زيدا(أوردر فاست) خلال فترة عضويتك بإرسال رسائل إلكترونية تروجية لتعريفك بأي تغيرات أو إجراءات أو نشاطات دعائية جديدة قد تضاف إلى الموقع. *** تنطبق هذه الشروط والأحكام على استخدامك للموقع الإلكتروني الموجود على ("موقع زيدا(أوردر فاست)"). باستخدام موقع زيدا(أوردر فاست)) ( فأنت توافق على الالتزام بهذه الشروط والأحكام. وفي حال عدم موافقتك على الشروطوالأحكام يتعين عليك عدم استخدام الموقع. نحتفظ بحقنا بتغيير الشروط والأحكام من وقت لآخر وعليه يتعين عليك الاطلاع على هذه الشروط والأحكام دوريا. ولا يتوجب علينا الاتصال بك أو إعلامك بأي تغييرات تم إجراؤها على الشروط والأحكام. ويعتبر استمرار استخدامك لموقع زيدا(أوردر فاست) بمثابة موافقة على الشروط والأحكام المطبقة في وقت استخدامك للموقع.',
              style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'لك لحق كمستخدم بتأكيد عدم رغبتك في تلقي الرسائل الإلكترونية الدعائية، ويمكنك إلغاء تلقي مثل هذه الرسائل، وذلك بالضغط على خيار طلب عدم إستلام رسائل ترويجية والمتوفرة في أسفل الرسائل الترويجية و الإعلانية',
              style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'موقع زيدا يقوم بتوزيع وبيع سلع ومنتجات خاصة بالموقع عبر الانترنت و يعد بمثابة سوق الكترونى للمنتجات والسلع التي يقوم بعرضها ما انه يجيز للمستخدم عرض اعلانات لمنتجات متصلة بنفس نوع الغرض الذي صمم له الموقع. والمستخدم مسئول ويقر علي ان جميع البيانات الخاصة به من ارقام تليفونات وعناوين هي صحيحة وتحت مسئوليته الشخصية ويتعرض للمسائلة القانونية في حالة مخالفة ذلك.',
              style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              '                                                                                                                         العلامة التجارية',
              style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'الشعارات المملوكة لموقع زيدا، والكلمات واللوجو والشعارات الأخرى على الموقع مثل (أوردر فاست)، هي علامات تجارية مسجلة وهي محمية بحقوق وقوانين ملكية العلامات التجارية الدولية والفكرية الاخرى ويحظر إستخدامها بدون موافقة كتابية من موقع زيدا والا سوف يتعرض من يستخدمها للمسائلة القانونية. علامات زيدا التجارية قد لا يتم استخدامها لمنتجات أو خدمات خارج السوق . كل العلامات التجارية الأخرى غير المملوكة لزيدا والتي تظهر على الموقع هي ملكية لأصحابها، والذين قد يكونوا أو لا يكونوا تابعين أو مرتبطين أو مرعيين من زيدا',
              style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              '                                                                                                                     دليل الاستخدام',
              style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              '  شركة زيدا ليست مسؤولة عن الإعلانات ومعلومات الدليل، والقوائم /المعلومات التجارية، والرسائل بين المستخدمين بما في ذلك وعلى سبيل المثال لا الحصر، رسائل البريد الإلكتروني المرسلة من خارج نطاق موقع زيدا أو غيرها من وسائل الاتصالات الإلكترونية سواء من خلال الموقع الإلكتروني أو موقع طرف ثالث أو العروض أو التعليقات أو منشورات المستخدمين أو الملفات أو الصور أو الرسوم أو  الفيديو أو الأصوات أو قوائم الأعمال/المعلومات ومعلومات الدليل أو أية مواد أخرى متوفرة عبر الموقع الإلكتروني والخدمة  ("المحتوى") شركة زيدا ليست مسئولة عن سوء الاستخدام موقع زيدا                                                                                                                                                                                                                                                       غير مسئول عن التفاصيل المعروضة من خلال أى طرف ثالث على الموقع. كما انه عند استخدامك الموقع الالكتروني والخدمة، قد تتعرض لمحتوى مسيء أو غير لائق أو غير دقيق، او مضلل، أو غير مقبول أوموضوع إعتراض.',
              style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'أنك تقر وتوافق على أنك مسؤول عن كل البينات و المعلومات التى تضيفها على موقع زيدا, وعليك أن تقيّم وتتحمل جميع المخاطر المرتبطة باستخدام أي محتوى. زيدا لن تكون تحت أي ظرف من الظروف مسؤولة بأي شكل من الأشكال عن المحتوى أو عن أي خسارة أو ضرر من أي نوع يحدث نتيجة للتصفح، أو استخدام أو قراءة أي محتوى مدون أو بريد إلكتروني أو غير ذلك متاح عبر الخدمة وغير مدرج منها. كافة الاعلانات والتعليقات علي سبيل المثال وليس الحصر الذي يقوم المتابع اوالمستخدم أو اي طرف اخر غير زيدا بعرضها علي الموقع فان موقع زيدا غير مسئولة عنها ولا تتحمل اي مسئولية ادبية او قانونية باي حال من الاحوال عن المحتوي. .السلوكيات إنك توافق على عدم وضع أية معلومات على الموقع أو استضافتها او عرضها او تحميلها او تغييرها او نشرها او نقلها او تحديثها او مشاركتها أو جعل المحتوى متاحًا بمعني محظور حظرا كاملا فى الحالات التالية: 1-وضع معلومات او افكار او أراء او توجهات دينية أو سياسية أو انتمائات طائفية أو عنصرية أو جنسية أو ايحاءات من شأنها إذدراء اي طائفة او شخص او انتهاكات مخالفة لسياسة موقع زيدا 2-انتهاك أي قانون أو قواعد قانونية؛ تكون ذات حقوق الطبع والنشر وبراءات الاختراع محمية بواسطة الأسرار التجارية أو العلامات التجارية، بما في ذلك الخصوصية وحقوق الدعاية، أو تخضع لملكية فكرية أخرى أو حقوق الملكية التابعة لطرف ثالث، بما في ذلك الخصوصية وحقوق الدعاية ما لم تكن مالك هذه الحقوق أو قد حصلت على إذن أو ترخيص من المالك الشرعي لنشر المواد ومنح التراخيص الممنوحة                                                                                                                                                                                                                                                                             انتهاك أية من حقوق الملكية الفكرية السابقة لأي طرف أو المحتوى الذي ليس لديك الحق في عرضه بموجب أي قانون او قواعد قانونية او العلاقة (العلاقات) التعاقدية أو الائتمانية 4- الحالات الضارة، المسيئة، الغير قانونية، التهديد، التحرش، التجديف، الفاضحة، الإباحية، التحرش الجنسي، التشهير، اقتحام خصوصية الآخرين أو غيرها من الحقوق، الكراهية، أو العرقية، محل الاعتراض العرقي، الاستخفاف، الحالات التى تتعلق أو تشجع على غسيل  الأموال أو القمار الغير الشرعي أو الأضرارأو ما يمكن أن يضر بالقاصرين بأي شكل من الأشكال أو بطريقة أخرى غير قانونية بأي طريقة كانت؛ 5-الحالات التي تتضمن معلومات شخصية أو تعريفية عن شخص آخر دون موافقة صريحة من ذلك الشخص؛ 6-الحالات التي تنتحل شخصية أي شخص أو كيان بما في ذلك، على سبيل المثال لا الحصر، لموظف ائتمان او شخصية مشهورة ؛ خداع  أو تضليل المرسل إليه حول أصل هذه الرسائل أو إيصال أية معلومات مهينة أو تهديدية بطبيعتها؛ المعلومات الخاطئة أو الخادعة أو المضللة أو المخادعة أو المراوغة أو تشكل عرضا" "لأشكال الاحتيال ',
              style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Text(
            ' الحالات التي تشكل أو تحتوي على "التسويق الشبكي"، "التسويق المتعدد المستويات"، "مخططات سلسلة بونزي والتسويق الهرمي" ، "التسويق التابع ،" "رابط رمز الإحالة ،" "البريد غير المرغوب فيه" ، "البريد المؤذي" ، "الرسائل المتسلسلة" أو الإعلانات غير المرغوب فيها ذات الطبيعة التجارية؛8-الحالات التي تشكل أو تحتوي على أي شكل من أشكال الإعلان أو الالتماس في حال: (1) وضعها في مناطق أو فئات من الموقع لم يتم  تخصيصها لهذه الأغراض او (2) إرسالها بالبريد الإلكتروني إلى المستخدمين الذين طلبوا عدم الاتصال بهم بشأن الخدمات الأخرى، المنتجات أو المصالح التجارية؛ تتضمن روابط الخدمات التجارية أو مواقع الأطراف الثالثة باستثناء ما يسمح به زيدا تحديدًا؛',
            style: TextStyle(
              fontStyle: FontStyle.italic,
              color: Colors.black,
              fontSize: 15,
            ),
          ),
          Text(
            'الحالات التي تعلن عن أي خدمات غير قانونية أو بيع أي سلع محظورة أو محظور بيعها بموجب القانون المعمول به، بما في ذلك على سبيل المثال لا الحصر البنود التي يحظر بيعها أو منظمة بموجب قانون الولاية القضائية المحلية المعمول به؛ الحالات التي تحتوي على فيروسات البرامج أو أي رمز كمبيوتر آخر، ملفات أو برامج مصممة للمقاطعة، تدمير أو تقييد وظيفة أي برنامج حاسوب أو أجهزة أو معدات اتصالات أو أي مورد حاسوب آخر؛الحالات التي تعطل التدفق الطبيعي للحوار مع عدد مفرط من الرسائل (هجوم السيل) الى الخدمة، أو تؤثر بشكل سلبي على قدرة المستخدمين الآخرين على استخدام الخدمة؛ أوالحالات التي تستخدم عناوين بريد إلكتروني المضللة، أو العناوين المزورة أو المعرّفات التي تم التلاعب بها بهدف إخفاء أصل المحتوى الذي يتم إرساله عبر الخدمة تقر وتوافق على أننا غير مسؤولين عن توافر أو محتوى أي موقع إلكتروني للغير والذي وصلت إليه عن طريق موقع زيدا . نحن لا نقر ولا يجوز بأي شكل كان أن نتحمل مسؤولية أي محتوى، أو إعلان، أو منتج، أو خدمة موجودة على أو متوفرة في مواقع إلكترونية للغير. ومع التقيد بالقوانين النافذة والتي لا يمكن استثنائها، فإننا لا نقدم ضمانات أو تعهدات أو التزامات مهما كانت (أ) فيما يخص نوعية، ودقة، وقابلية بيع، أو ملاءمة المادة للغرض منها، والمنتجات، والخدمات على أو متوافرة من خلال المواقع الإلكترونية للغير؛ أو (ب) أن المادة على أو المتوفرة من خلال المواقع الإلكترونية للغير لا تخالف حقوق الملكية الفكرية لأي شخص أي تعامل يتم بينك وبين أطراف ثالثة من معلنين أو تجار موجودين على أو من خلال موقع بزيدا ، بما في ذلك الدفع مقابل وتوصيل المنتجات، والخدمات أو أي شروط، أو أحكام، أو ضمانات، أو تعهدات مرتبطة بتلك التعاملات، فإنها تتم بينك وبين المعلن أو التاجر المعني. وعليه، فإننا لا نتحمل أية مسؤولية أو التزام نتيجة الخسارة أو الأضرار من أي نوع والتي حدثت نتيجة لمثل هذه التعاملات نهتم بخصوصيتك وأمنك بشكل كبير. ويتم جمع بعض البيانات لاستخدامها عن طريق موقع زيدا من أجل توفير خدمات عبر الإنترنت التي يتم توفيرها عن طريق موقع زيدا. سوف يقوم موقع زيدا بتسجيل ومتابعة استخدامك لموقعزيدا من خلال استخدام، على سبيل المثال لا الحصر، الملفات النصية القصيرة (كوكيز) وغيرها من أدوات وأجهزة المتابعة. ويخضع استخدام هذه البيانات لبنود سياسة الخصوصية التي نطبقها. تعتبر سياسية الخصوصية جزءا من هذه الشروط والأحكام ويجب أن تقرأها بالكامل. في حال عدم قبولك بالشروط في سياسة الخصوصية، فيتوجب عليك أن تمتنع عن استخدام موقع زيدا - ',
            style: TextStyle(
              fontStyle: FontStyle.italic,
              color: Colors.black,
              fontSize: 15,
            ),
          ),
           Text(
            'تفضل  باستخدام نموذج التغذية الراجعة على موقع بيتسي بيتسي لإعلامنا بأي تغيير في المعلومات التي قدمتها مسبقا أو إذا رغبت في سحب موافقتك على استخدامنا للمعلومات التي قدمتها لنا للأغراض التي تم تحديدها أو من أجل أي شكل من أشكال التواصل الإعلاني ',
            style: TextStyle(
              fontStyle: FontStyle.italic,
              color: Colors.black,
              fontSize: 15,
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'وضمانا للتعاون مع الطلبات الحكومية المشروعة، واستدعاءات وأوامر المحكمة، وحماية للمستخدمين الآخرين، وأنظمتنا، فإننا قد نقوم بالوصول إلى والإفصاح عن أية معلومات نعتقد أنها ضرورية أو مناسبة، بما في ذلك، على سبيل المثال لا الحصر، معلومات ملف المستخدم الخاص بك (الاسم، عنوان البريد الإلكتروني، إلخ)، عنوان بروتوكول الإنترنت، ومعلومات المرور، وتاريخ الاستخدام، والمحتوى الذي تم تقديمه لموقع بيتسي بيتسي ويكون حقنا في الإفصاح عن أية معلومات من هذا النوع مقدما على وسابقا لالتزامنا ببنود سياسة الخصوصية',
               style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
           Padding(
             padding: const EdgeInsets.all(20.0),
             child: Text(
              'وفي حالة أنتهاك أى من القواعد السابق ذكرها فأن من حق موقع بتسى بتسى بشطبها على الفور بدون الرجوع لصاحب المنشور. كما يحق لموقع زيدا مسألة منتهك القواعد و الشروط السابق ذكرها قانونيا',
               style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
          ),
           ),
           Text(
            'بالاضافه إلى ذلك، فإنك توافق على عدم: جمع البيانات الشخصية عن المستخدمين أو الكيانات الأخرى لأغراض تجارية أو غير قانونية؛ استخدام الوسائل الآلية، بما في ذلك العناكب، والروبوتات، الزواحف، أدوات استخراج البيانات أو ما شابه للتنزيل أو كشط البيانات من الخدمة باستثناء محركات البحث على الإنترنت على سبيل المثال، Google والأرشيفات العامة غير التجارية على سبيل المثال org والتي تتوافق مع ملف robots.txt file الخاص بنا؛',
             style: TextStyle(
              fontStyle: FontStyle.italic,
              color: Colors.black,
              fontSize: 15,
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'محاوله الوصول غير المصرح به إلى أنظمة الكمبيوتر التي تملكها أو تتحكم فيها زيدا أو الانخراط في أي نشاط يعطل، او يقلل من جودة ويتعارض مع الأداء أو يعوق وظيفة الخدمة أو الموقع الإلكتروني',
               style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Text(
              'استخدام أي جهاز أو برنامج آلي يمكّن من إرسال النشرات التلقائية على موقع زيدا دون تدخل بشري أو التأليف ("جهاز نشر تلقائي) علاوة على ذلك، إذا تبين أنك في حالة عدم امتثالك للقوانين وللقواعد القانونية وهذه الشروط، أو سياسة الخصوصية للموقع، يجوز لنا إنهاء حسابك / حظر دخولك إلى الموقع ونحن نحتفظ بالحق في إزالة أي محتوى غير متوافق تم تحميله بواسطتك والاحتفاظ بكافة حقوق الموقع القانونية والحقوق الاخري',
               style: TextStyle(
                fontStyle: FontStyle.italic,
                color: Colors.black,
                fontSize: 15,
              ),
            ),
          ),
        ],
      ),
    );
  }
}
